app/controllers/cookbooks_controller.rb

  def update
    cookbook = Cookbook.find(params[:cookbook_id])
    if params[:remove]
      recipe = Recipe.find_by(label: params[:label])
      cookbook.recipes.delete(recipe)
    else
      # binding.pry
      params[:recipe][:ingredientLines].join('\n')

      recipe = Recipe.find_or_create_by(recipe_params)

      if params[:recipe][:ingredients]
        params[:recipe][:ingredients].map do |ingredient|
          recipe.ingredients << Ingredient.find_or_create_by(name: ingredient[:food])
---
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."name" = $1 LIMIT $2  [["name", "tuna"], ["LIMIT", 1]]