app/controllers/cookbooks_controller.rb

SELECT  "cookbooks".* FROM "cookbooks" WHERE "cookbooks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."label" = $1 LIMIT $2  [["label", "French in a Flash: Moroccan Spiced Seared Rare Tuna"], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 4]]
INSERT INTO "recipes" ("label", "image", "url", "created_at", "updated_at", "ingredient_lines") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "recipes".* FROM "recipes" ORDER BY "recipes"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = $1  [["recipe_id", 9]]
INSERT INTO "ingredients" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "rice wine vinegar"], ["created_at", 2016-11-15 21:51:29 UTC], ["updated_at", 2016-11-15 21:51:29 UTC]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."text" = $1 AND "ingredients"."food" = $2 LIMIT $3  [["text", "4 baby chickens (poussins) or cornish hens (about 1 1/4 pounds each), or 4 chicken breast halves"], ["food", "chickens"], ["LIMIT", 1]]
SELECT  1 AS one FROM "ingredients" WHERE "ingredients"."recipe_id" = $1 AND "ingredients"."id" = $2 LIMIT $3  [["recipe_id", 6], ["id", 15], ["LIMIT", 1]]
SELECT  1 AS one FROM "recipes" INNER JOIN "recipe_cookbooks" ON "recipes"."id" = "recipe_cookbooks"."recipe_id" WHERE "recipe_cookbooks"."cookbook_id" = $1 AND "recipes"."id" = $2 LIMIT $3  [["cookbook_id", 1], ["id", 5], ["LIMIT", 1]]
SELECT "ingredients".* FROM "ingredients" INNER JOIN "recipes" ON "ingredients"."recipe_id" = "recipes"."id" INNER JOIN "recipe_cookbooks" ON "recipes"."id" = "recipe_cookbooks"."recipe_id" WHERE "recipe_cookbooks"."cookbook_id" = $1  [["cookbook_id", 1]]
SELECT "recipes".* FROM "recipes" INNER JOIN "recipe_cookbooks" ON "recipes"."id" = "recipe_cookbooks"."recipe_id" WHERE "recipe_cookbooks"."cookbook_id" = $1  [["cookbook_id", 5]]
UPDATE "ingredients" SET "updated_at" = $1, "recipe_id" = $2 WHERE "ingredients"."id" = $3  [["updated_at", 2016-11-15 21:51:29 UTC], ["recipe_id", 10], ["id", 40]]
---
  def update
    cookbook = Cookbook.find(params[:cookbook_id])
    if params[:remove]
      recipe = Recipe.find_by(label: params[:label])
      cookbook.recipes.delete(recipe)

    else
      recipe = Recipe.find_or_create_by(recipe_params)
      if params[:recipe][:ingredients]
        params[:recipe][:ingredients].map do |ingredient|
          ingredient = Ingredient.find_or_create_by(text: ingredient[:text], food: ingredient[:food])
          recipe.ingredients << ingredient unless recipe.ingredients.include?(ingredient)
        end
      end
      recipe.save