app/controllers/health_labels_controller.rb

SELECT "health_labels".* FROM "health_labels"
---
  def index
    render json: HealthLabel.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "health_labels".* FROM "health_labels" WHERE "health_labels"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "user_health_labels" ("user_id", "health_label_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["health_label_id", 3], ["created_at", 2016-11-16 23:20:07 UTC], ["updated_at", 2016-11-16 23:20:07 UTC]]
SELECT "health_labels".* FROM "health_labels"
---
  def update
    user = User.find(params[:user_id])
    health_label = HealthLabel.find(params[:id])
    user.health_labels << health_label
    labels = HealthLabel.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "health_labels".* FROM "health_labels" WHERE "health_labels"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "user_health_labels" WHERE "user_health_labels"."user_id" = $1 AND "user_health_labels"."health_label_id" = 3  [["user_id", 1]]
---
  def destroy
    user = User.find(params[:user_id])
    health_label = HealthLabel.find(params[:id])
    user.health_labels.delete(health_label)