app/controllers/recipes_controller.rb

SELECT  "cookbooks".* FROM "cookbooks" WHERE "cookbooks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "ingredients" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "lime juice"], ["created_at", 2016-11-15 19:11:05 UTC], ["updated_at", 2016-11-15 19:11:05 UTC]]
INSERT INTO "recipes" ("label", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["label", "Test Pilot"], ["created_at", 2016-11-15 18:49:01 UTC], ["updated_at", 2016-11-15 18:49:01 UTC]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."label" = $1 AND "recipes"."image" = $2 AND "recipes"."url" = $3 AND "recipes"."ingredient_lines" = $4 LIMIT $5
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = $1  [["recipe_id", 3]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."name" = $1 LIMIT $2  [["name", "lime juice"], ["LIMIT", 1]]
UPDATE "ingredients" SET "recipe_id" = $1, "updated_at" = $2 WHERE "ingredients"."id" = $3  [["recipe_id", 5], ["updated_at", 2016-11-15 20:18:33 UTC], ["id", 10]]
---
  def create
    cookbook = Cookbook.find(params[:cookbook_id])
    # for params[:recipe] do |recipe|
    # end
    recipe = Recipe.find_or_create_by(
      label: params[:recipe][:label],
      image: params[:recipe][:image],
      url: params[:recipe][:url],
      ingredient_lines: params[:recipe][:ingredientLines].join("\n")
      )

    params[:recipe][:ingredients].map do |ingredient|
      recipe.ingredients << Ingredient.find_or_create_by(name: ingredient[:food])
    end
    recipe.ingredients.uniq{|ing| ing.name}
    recipe.save

SELECT  "cookbooks".* FROM "cookbooks" WHERE "cookbooks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    cookbook = Cookbook.find(params[:cookbook_id])
    recipe = Recipe.find(params[:id])