app/controllers/shopping_lists_controller.rb

  def update
    shopping_list = ShoppingList.find(params[:shopping_list_id])
    ingredient = Ingredient.find(params[:id])
    shopping_list.ingredients << ingredient
---
SELECT  "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "shopping_list_ingredients" ("shopping_list_id", "ingredient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["shopping_list_id", 1], ["ingredient_id", 1], ["created_at", 2016-11-16 20:35:56 UTC], ["updated_at", 2016-11-16 20:35:56 UTC]]

  def destroy
    shopping_list = ShoppingList.find(params[:shopping_list_id])
    ingredient = Ingredient.find(params[:id])
    shopping_list.ingredients.delete(ingredient)
---
SELECT  "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "shopping_list_ingredients" WHERE "shopping_list_ingredients"."shopping_list_id" = $1 AND "shopping_list_ingredients"."ingredient_id" = 1  [["shopping_list_id", 1]]